{
    "displayName": "501 - <RING> - Data protection - All apps: Short Sign-in frequency When on untrusted device",
    "createdDateTime": null,
    "modifiedDateTime": null,
    "state": "enabledForReportingButNotEnforced",
    "grantControls": null,
    "conditions": {
        "signInRiskLevels": [],
        "clientAppTypes": [],
        "platforms": null,
        "locations": null,
        "deviceStates": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [
                "<ExclusionTempGroup>",
                "<ExclusionPermGroup>",
                "<EmergencyAccessAccountsGroup>"
            ],
            "includeRoles": [],
            "excludeRoles": []
        },
        "devices": {
            "includeDeviceStates": [
                "All"
            ],
            "excludeDeviceStates": [
                "Compliant",
                "DomainJoined"
            ]
        }
    },
    "sessionControls": {
        "applicationEnforcedRestrictions": null,
        "cloudAppSecurity": null,
        "persistentBrowser": null,
        "signInFrequency": {
            "value": 1,
            "type": "hours",
            "isEnabled": true
        }
    }
}